<?php
/* +--------------------------------------------------------------------+
 * | Trees [ AS is nature as is from~ ]
 * +--------------------------------------------------------------------+
 * | Copyright (c) 2010-2015 http://www.coospeak.com All rights reserved
 * +--------------------------------------------------------------------+
 * | Licensed ( http://www.trees.org.cn/licenses/LICENSE-2.0 )
 * +--------------------------------------------------------------------+
 * | Author: Luisxue <Blog:Luisxue.sinaapp.com> <Email:4214659@qq.com>
 * +--------------------------------------------------------------------+
 * +--------------------------------------------------------------------+
 * | Create Date: 2015.06.10
 * +--------------------------------------------------------------------+
*/
/* +--------------------------------+
 * | Trees框架 应用树入口 (种树)
 * +--------------------------------+*/
// 应用树环境监测 
if(version_compare(PHP_VERSION,'5.3.0','<'))  die('require PHP > 5.3.0 !');

// 1.应用树服务设置  服务等级(0~3)三个等级{顺序为由低到高}
define('APP_SERVICE',1);
// 2.应用树性能设置  性能等级(0~5)六个等级{顺序为由低到高}
define('APP_BUILD',1); 
// 3.应用树安全检测  安全等级(0~3)三个等级{顺序为由低到高}
define('APP_GUARD',1); 
// 4.应用树成长设置 建议开发阶段开启 部署阶段注释或者设为false
define('APP_DEBUG',True);
// 5.定义应用树名称和位置
define('APP_PATH','../Application/');
// 加载Trees入口文件
require '../Trees/Treescore.php';

// 12345加载 搞定~ 亲^_^ 后面不需要任何代码了 就是如此简单~哈哈